/* ----------------------------------------------------------------------   
*
* Заголовочный файл математических функций
*
* Copyright (C) 2015 МИРЭА   
* Версия:      V1.0.3
*   
* -------------------------------------------------------------------- */

#ifndef _MATHFUNC_H
#define _MATHFUNC_H

#include <stdint.h>

//#define PI        3.14159265358979323846f

/* Приведение числа в формате float к дробному формату 1.15 */
int16_t float_to_q15(float src);

/* Приведение числа в формате float к дробному формату 1.31 */
int32_t float_to_q31(float src);

/* Приведение числа в дробном формате 1.15 к формату float */
float q15_to_float(int16_t src);

/* Умножение чисел в дробном формате 1.15 с получением результата в формате 1.15 */
int16_t mul_fract(int16_t x, int16_t y);

/* Вычисление sin от аргумента в дробном формате 1.15 */
int16_t sin_q15(int16_t arg);

#endif /* _MATHFUNC_H */
