/**
  ******************************************************************************
  * Файл      adc.h
  * Copyright (C) 2015 МГТУ МИРЭА
  * Версия    2.0
  * Описание: Функции инициализации и обслуживания АЦП
  ******************************************************************************
  */ 

#ifndef _ADC_H
#define _ADC_H

/* Объявления функций для их использования в других программных модулях */
void ADC_Initialize(ADC_TypeDef* ADCx, uint8_t ADC_Channel, uint32_t ADC_ExternalTrigConv);

//---------------------------------------------------------------------------
#endif /* _ADC_H */
