/**
  ******************************************************************************
  * Файл      codec.h
  * Copyright (C) 2016 МИРЭА
  * Версия    2.2
  * Описание: Функции инициализации и обслуживания аудиокодека
  ******************************************************************************
  */ 

#ifndef _CODEC_H
#define _CODEC_H

/* Объявления функций для их использования в других программных модулях */
void SoundCodecConfig(uint32_t AudioFreq);
void SoundCodecInterruptConfig(FunctionalState NewState);
void Sample_Handler(void);                     //Эта функция - для реализации в другом модуле 

#endif /* _CODEC_H */
