//---------------------------------------------------------------------------
// 
//  УЧЕБНЫЙ ПРОЕКТ (ШАБЛОН)
//  Программирование ...
//  Автор:
//
//---------------------------------------------------------------------------

#include "stm32_p407.h"                 //Файл конфигурации отладочной платы
#include "lcd.h"                        //Функции для работы с дисплеем

//---------------------------------------------------------------------------

int main()
{
  int x = 2, y = 2;
  
  //Инициализация дисплея
  LCD_Init(); LCD_Clear(1); LCD_FontSize(11);

  //Тестовый вывод
  LCD_print(" УЧЕБНЫЙ ПРОЕКТ\r\n\r\n"
            "   Выполнение\r\n"
            " индивидуального\r\n"
            "    задания\r\n\r\n"
            "   %d + %d = %d", x, y, x+y);
  LCD_PenColor(0x00F); LCD_Rectangle(40, 92, 25, 30);
  LCD_PenColor(0x0F0); LCD_Rectangle(10, 122, 94, 100);
  
  while (1) {}
}

//---------------------------------------------------------------------------
